# Akshay Mahi

## Research question/interests

Question: **Is concentration of NOx in the atmopshere positively correlated with air temperatures and humidity- what is the bearing of time on the output?**

The current plan is to clean up the data, remove any unnessicary columns in addition to columns with data that were not measured. From that, I plan to use plot functions to determine the relationships. Some time will be spent understanding AH and RH, seeing if the terms can be combined into a single column or if one of the columns provides better information when searching for correlations. The other idea I was also considering

In [ ]:
import pandas as pd
import seaborn as sns 
import numpy as np 
import matplotlib.pylab as plt
df = pd.read_csv("../data/raw/AirQualityUCI.csv", sep=";")

df

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),C6H6(GT),PT08.S2(NMHC),NOx(GT),PT08.S3(NOx),NO2(GT),PT08.S4(NO2),PT08.S5(O3),T,RH,AH,Unnamed: 15,Unnamed: 16
0,10/03/2004,18.00.00,"2,6",1360.0,150.0,"11,9",1046.0,166.0,1056.0,113.0,1692.0,1268.0,"13,6","48,9","0,7578",NaN,NaN
1,10/03/2004,19.00.00,2,1292.0,112.0,"9,4",955.0,103.0,1174.0,92.0,1559.0,972.0,"13,3","47,7","0,7255",NaN,NaN
2,10/03/2004,20.00.00,"2,2",1402.0,88.0,"9,0",939.0,131.0,1140.0,114.0,1555.0,1074.0,"11,9","54,0","0,7502",NaN,NaN
3,10/03/2004,21.00.00,"2,2",1376.0,80.0,"9,2",948.0,172.0,1092.0,122.0,1584.0,1203.0,"11,0","60,0","0,7867",NaN,NaN
4,10/03/2004,22.00.00,"1,6",1272.0,51.0,"6,5",836.0,131.0,1205.0,116.0,1490.0,1110.0,"11,2","59,6","0,7888",NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9466,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9467,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9468,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9469,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9470,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
for col in df.columns:
    print(col)

Date
Time
CO(GT)
PT08.S1(CO)
NMHC(GT)
C6H6(GT)
PT08.S2(NMHC)
NOx(GT)
PT08.S3(NOx)
NO2(GT)
PT08.S4(NO2)
PT08.S5(O3)
T
RH
AH
Unnamed: 15
Unnamed: 16

In [ ]:
df = df.rename(columns={'NOx(GT)':'NOx_GT'})
df = df.drop(df.columns[[2, 3, 4, 5, 6, 8, 9, 10, 11 ,15, 16,]], axis=1)

df

            Date      Time  NOx_GT     T    RH      AH
0     10/03/2004  18.00.00   166.0  13,6  48,9  0,7578
1     10/03/2004  19.00.00   103.0  13,3  47,7  0,7255
2     10/03/2004  20.00.00   131.0  11,9  54,0  0,7502
3     10/03/2004  21.00.00   172.0  11,0  60,0  0,7867
4     10/03/2004  22.00.00   131.0  11,2  59,6  0,7888
...          ...       ...     ...   ...   ...     ...
9466         NaN       NaN     NaN   NaN   NaN     NaN
9467         NaN       NaN     NaN   NaN   NaN     NaN
9468         NaN       NaN     NaN   NaN   NaN     NaN
9469         NaN       NaN     NaN   NaN   NaN     NaN
9470         NaN       NaN     NaN   NaN   NaN     NaN

[9471 rows x 6 columns]

In [ ]:
df = df.dropna()
df

            Date      Time  NOx_GT     T    RH      AH
0     10/03/2004  18.00.00   166.0  13,6  48,9  0,7578
1     10/03/2004  19.00.00   103.0  13,3  47,7  0,7255
2     10/03/2004  20.00.00   131.0  11,9  54,0  0,7502
3     10/03/2004  21.00.00   172.0  11,0  60,0  0,7867
4     10/03/2004  22.00.00   131.0  11,2  59,6  0,7888
...          ...       ...     ...   ...   ...     ...
9352  04/04/2005  10.00.00   472.0  21,9  29,3  0,7568
9353  04/04/2005  11.00.00   353.0  24,3  23,7  0,7119
9354  04/04/2005  12.00.00   293.0  26,9  18,3  0,6406
9355  04/04/2005  13.00.00   235.0  28,3  13,5  0,5139
9356  04/04/2005  14.00.00   265.0  28,5  13,1  0,5028

[9357 rows x 6 columns]

In [ ]:
df = df[(df.NOx_GT != -200)]
df = df.reset_index(drop=True)

df

            Date      Time  NOx_GT     T    RH      AH
0     10/03/2004  18.00.00   166.0  13,6  48,9  0,7578
1     10/03/2004  19.00.00   103.0  13,3  47,7  0,7255
2     10/03/2004  20.00.00   131.0  11,9  54,0  0,7502
3     10/03/2004  21.00.00   172.0  11,0  60,0  0,7867
4     10/03/2004  22.00.00   131.0  11,2  59,6  0,7888
...          ...       ...     ...   ...   ...     ...
7713  04/04/2005  10.00.00   472.0  21,9  29,3  0,7568
7714  04/04/2005  11.00.00   353.0  24,3  23,7  0,7119
7715  04/04/2005  12.00.00   293.0  26,9  18,3  0,6406
7716  04/04/2005  13.00.00   235.0  28,3  13,5  0,5139
7717  04/04/2005  14.00.00   265.0  28,5  13,1  0,5028

[7718 rows x 6 columns]

In [ ]:
df['Date'] = pd.to_datetime(df.Date)
df.set_index("Date")
df

C:\Users\someb\AppData\Local\Temp\ipykernel_13924\3864622993.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df['Date'] = pd.to_datetime(df.Date)

           Date      Time  NOx_GT     T    RH      AH
0    2004-10-03  18.00.00   166.0  13,6  48,9  0,7578
1    2004-10-03  19.00.00   103.0  13,3  47,7  0,7255
2    2004-10-03  20.00.00   131.0  11,9  54,0  0,7502
3    2004-10-03  21.00.00   172.0  11,0  60,0  0,7867
4    2004-10-03  22.00.00   131.0  11,2  59,6  0,7888
...         ...       ...     ...   ...   ...     ...
7713 2005-04-04  10.00.00   472.0  21,9  29,3  0,7568
7714 2005-04-04  11.00.00   353.0  24,3  23,7  0,7119
7715 2005-04-04  12.00.00   293.0  26,9  18,3  0,6406
7716 2005-04-04  13.00.00   235.0  28,3  13,5  0,5139
7717 2005-04-04  14.00.00   265.0  28,5  13,1  0,5028

[7718 rows x 6 columns]

In [ ]:
df

           Date      Time  NOx_GT     T    RH      AH
0    2004-10-03  18.00.00   166.0  13,6  48,9  0,7578
1    2004-10-03  19.00.00   103.0  13,3  47,7  0,7255
2    2004-10-03  20.00.00   131.0  11,9  54,0  0,7502
3    2004-10-03  21.00.00   172.0  11,0  60,0  0,7867
4    2004-10-03  22.00.00   131.0  11,2  59,6  0,7888
...         ...       ...     ...   ...   ...     ...
7713 2005-04-04  10.00.00   472.0  21,9  29,3  0,7568
7714 2005-04-04  11.00.00   353.0  24,3  23,7  0,7119
7715 2005-04-04  12.00.00   293.0  26,9  18,3  0,6406
7716 2005-04-04  13.00.00   235.0  28,3  13,5  0,5139
7717 2005-04-04  14.00.00   265.0  28,5  13,1  0,5028

[7718 rows x 6 columns]